In [2]:
import pandas as pd
print(pd.__version__)

2.2.0

In [7]:
data = {'nama': ['Messi', 'Ronaldo', 'James', 'Curry'],
        'jenis_kelamin': ['L', 'L', 'L', 'L'], 
        'usia': [36, 38, 40, 35]}

df = pd.DataFrame(data)
df

      nama jenis_kelamin  usia
0    Messi             L    36
1  Ronaldo             L    38
2    James             L    40
3    Curry             L    35

In [8]:
df['nama'].str.cat(df['jenis_kelamin'], sep=', ').to_frame()

         nama
0    Messi, L
1  Ronaldo, L
2    James, L
3    Curry, L

In [9]:
df['nama'].str.cat(df['usia'].astype('str'), sep=' - ').to_frame()

           nama
0    Messi - 36
1  Ronaldo - 38
2    James - 40
3    Curry - 35

In [10]:
df['nama_usia'] = df['nama'].str.cat(df['usia'].astype('str'), sep=' - ')
df

      nama jenis_kelamin  usia     nama_usia
0    Messi             L    36    Messi - 36
1  Ronaldo             L    38  Ronaldo - 38
2    James             L    40    James - 40
3    Curry             L    35    Curry - 35